import streamlit as st
import requests as req

st.header("🌞お天気情報🏝️",anchor='section1',divider='rainbow')

def otenki(): 

    option = st.selectbox(
        "**都道府県名を選択** (直接入力も可能）",(code),index = 18,format_func=lambda x:  str(x)+" : " +code[x])

    area = str(code[option])

    url = "https://www.jma.go.jp/bosai/forecast/data/overview_forecast/"+area+".json"
    res = req.get(url)
    weather = res.json()

    body = weather["headlineText"]+weather[u'text']+weather[u'reportDatetime']
    body = body.replace("\n",'')

    st.write(f"**🌞{weather[u'targetArea']}の天気🌈**")
    st.write(body)
    st.write("https://www.jma.go.jp/bosai/forecast/#area_type=offices&area_code="+area)

code = {
'宗谷地方' : '011000', 
 '上川・留萌地方' : '012000', 
 '網走・北見・紋別地方' : '013000', 
 '釧路・根室地方・十勝地方' : '014100', 
 '胆振・日高地方' : '015000', 
 '石狩・空知・後志地方' : '016000', 
 '渡島・檜山地方' : '017000', 
 '青森県' : '020000', 
 '岩手県' : '030000', 
 '宮城県' : '040000', 
 '秋田県' : '050000', 
 '山形県' : '060000', 
 '福島県' : '070000', 
 '茨城県' : '080000', 
 '栃木県' : '090000', 
 '群馬県' : '100000', 
 '埼玉県' : '110000', 
 '千葉県' : '120000', 
 '東京都' : '130000', 
 '神奈川県' : '140000', 
 '新潟県' : '150000', 
 '富山県' : '160000', 
 '石川県' : '170000', 
 '福井県' : '180000', 
 '山梨県' : '190000', 
 '長野県' : '200000', 
 '岐阜県' : '210000', 
 '静岡県' : '220000', 
 '愛知県' : '230000', 
 '三重県' : '240000', 
 '滋賀県' : '250000', 
 '京都府' : '260000', 
 '大阪府' : '270000', 
 '兵庫県' : '280000', 
 '奈良県' : '290000', 
 '和歌山県' : '300000', 
 '鳥取県' : '310000', 
 '島根県' : '320000', 
 '岡山県' : '330000', 
 '広島県' : '340000', 
 '山口県' : '350000', 
 '徳島県' : '360000', 
 '香川県' : '370000', 
 '愛媛県' : '380000', 
 '高知県' : '390000', 
 '福岡県' : '400000', 
 '佐賀県' : '410000', 
 '長崎県' : '420000', 
 '熊本県' : '430000', 
 '大分県' : '440000', 
 '宮崎県' : '450000', 
 '奄美地方' : '460040', 
 '鹿児島県（奄美地方除く）' : '460100', 
 '沖縄本島地方' : '471000', 
 '大東島地方' : '472000', 
 '宮古島地方' : '473000', 
 '八重山地方' : '474000', }

otenki()
st.divider()
st.write('出典：気象庁')
st.markdown("[go to Top](#section1)")
